[
  {
    "number": "1",
    "title": "VioletWing Notifications",
    "url": "https://github.com/Jesewe/VioletWing",
    "timestamp": "2025-07-12",
    "message": "Introducing VioletWing Notifications, a new feature that keeps you updated with the latest changes and improvements in the VioletWing project. Stay informed about new releases, bug fixes, and enhancements directly from the development team."
  },
  {
    "number": "2",
    "title": "Offsets in VioletWing",
    "url": "https://github.com/Jesewe/VioletWing?tab=readme-ov-file#troubleshooting",
    "timestamp": "2025-07-30",
    "message": "If you see an error message saying \"Could not read memory at\", this does not mean that there is a program error. We have no influence on the operation of offsets. Please wait for the a2x/cs2-dumper offset update."
  },
  {
    "number": "3",
    "title": "VioletWing Update (Hotfix)",
    "url": "https://github.com/Jesewe/VioletWing/releases/tag/v1.2.7",
    "timestamp": "2025-08-06",
    "message": "VioletWing has been updated to version 1.2.7. This release includes various bug fixes and performance improvements."
  },
  {
    "number": "4",
    "title": "VioletWing Update 1.2.8 (ESP fix)",
    "url": "https://github.com/Jesewe/VioletWing/releases/tag/v1.2.8",
    "timestamp": "2025-08-16",
    "message": "VioletWing has been updated to version 1.2.8. This release includes a fix for the ESP feature."
  },
  {
    "number": "5",
    "title": "VioletWing Help Center",
    "url": "https://violetwing.featurebase.app/en/help",
    "timestamp": "2025-09-09",
    "message": "We have launched the VioletWing Help Center to provide users with comprehensive guides, FAQs, and troubleshooting tips. Visit the Help Center to find answers to common questions and learn how to make the most of VioletWing."
  },
  {
    "number": "6",
    "title": "VACNet Anti-Cheat Update Warning",
    "url": "https://github.com/Jesewe/VioletWing?tab=readme-ov-file#disclaimer",
    "timestamp": "2025-09-26",
    "message": "VACNet, the anti-cheat system for Counter-Strike 2, has been significantly improved. Using VioletWing or similar tools may result in detection and bans. Proceed with caution and use at your own risk."
  }
]